import java.util.Scanner;

public class ThirdClass {

    //Напишите программу на Java, которая принимает на вход два числа
    // с плавающей запятой и выводит их произведение в виде целого числа.
    // Для этого выполните приведение типов данных.
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.print("Введите первое число с плавающей запятой: ");

        /*
        *Тип данных* num1 = scanner.nextDouble();

        System.out.print("Введите второе число с плавающей запятой: ");
        *Тип данных* num2 = scanner.nextDouble();

        *Тип данных* product = (*Тип данных*) (num1 * num2);

        System.out.println("Произведение в виде целого числа: " + product);

         */
    }
}